<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>14.2. Match</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0-M06" /><link rel="up" href="query-read.html" title="Chapter 14. Reading Clauses" /><link rel="prev" href="query-start.html" title="14.1. Start" /><link rel="next" href="query-where.html" title="14.3. Where" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 5. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorials-rest.html" title="Chapter 6. Neo4j Remote Client Libraries" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 7. The Traversal Framework" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 8. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 9. Languages" /><link rel="chapter" href="server-extending.html" title="Chapter 10. Extending the Neo4j Server" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 11. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 12. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 13. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 14. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 15. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 16. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 17. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 18. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 19. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 20. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 21. Data Import" /><link rel="chapter" href="indexing.html" title="Chapter 22. Legacy Indexing" /><link rel="chapter" href="graph-algo.html" title="Chapter 23. Graph Algorithms" /><link rel="chapter" href="server.html" title="Chapter 24. Neo4j Server" /><link rel="chapter" href="rest-api.html" title="Chapter 25. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 26. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 27. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 28. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 29. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 30. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 31. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 32. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 33. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 34. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 35. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 36. Contributing to Neo4j" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-shell" /><link rel="refentry" href="re03.html" title="neo4j-backup" /><link rel="refentry" href="re04.html" title="neo4j-arbiter" /><link rel="subsection" href="query-match.html#_introduction" title="14.2.1. Introduction" /><link rel="subsection" href="query-match.html#match-get-all-nodes" title="14.2.2. Get all nodes" /><link rel="subsection" href="query-match.html#match-get-all-nodes-with-a-label" title="14.2.3. Get all nodes with a label" /><link rel="subsection" href="query-match.html#match-related-nodes" title="14.2.4. Related nodes" /><link rel="subsection" href="query-match.html#match-outgoing-relationships" title="14.2.5. Outgoing relationships" /><link rel="subsection" href="query-match.html#match-directed-relationships-and-identifier" title="14.2.6. Directed relationships and identifier" /><link rel="subsection" href="query-match.html#match-match-by-relationship-type" title="14.2.7. Match by relationship type" /><link rel="subsection" href="query-match.html#match-match-by-multiple-relationship-types" title="14.2.8. Match by multiple relationship types" /><link rel="subsection" href="query-match.html#match-match-by-relationship-type-and-use-an-identifier" title="14.2.9. Match by relationship type and use an identifier" /><link rel="subsection" href="query-match.html#match-match-with-labels" title="14.2.10. Match with labels" /><link rel="subsection" href="query-match.html#match-relationship-types-with-uncommon-characters" title="14.2.11. Relationship types with uncommon characters" /><link rel="subsection" href="query-match.html#match-multiple-relationships" title="14.2.12. Multiple relationships" /><link rel="subsection" href="query-match.html#match-variable-length-relationships" title="14.2.13. Variable length relationships" /><link rel="subsection" href="query-match.html#match-relationship-identifier-in-variable-length-relationships" title="14.2.14. Relationship identifier in variable length relationships" /><link rel="subsection" href="query-match.html#match-zero-length-paths" title="14.2.15. Zero length paths" /><link rel="subsection" href="query-match.html#match-optional-relationship" title="14.2.16. Optional relationship" /><link rel="subsection" href="query-match.html#match-optional-typed-and-named-relationship" title="14.2.17. Optional typed and named relationship" /><link rel="subsection" href="query-match.html#match-properties-on-optional-elements" title="14.2.18. Properties on optional elements" /><link rel="subsection" href="query-match.html#match-shortest-path" title="14.2.19. Shortest path" /><link rel="subsection" href="query-match.html#match-all-shortest-paths" title="14.2.20. All shortest paths" /><link rel="subsection" href="query-match.html#match-named-path" title="14.2.21. Named path" /><link rel="subsection" href="query-match.html#match-matching-on-a-bound-relationship" title="14.2.22. Matching on a bound relationship" /><link rel="copyright" href="ln-idp1064128.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-link"><a href="query-read.html">Reading Clauses</a></span> &gt; <span class="breadcrumb-node">Match</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-start.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-where.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-match"></a>14.2. Match</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-match.html#_introduction">14.2.1. Introduction</a></span></dt><dt><span class="section"><a href="query-match.html#match-get-all-nodes">14.2.2. Get all nodes</a></span></dt><dt><span class="section"><a href="query-match.html#match-get-all-nodes-with-a-label">14.2.3. Get all nodes with a label</a></span></dt><dt><span class="section"><a href="query-match.html#match-related-nodes">14.2.4. Related nodes</a></span></dt><dt><span class="section"><a href="query-match.html#match-outgoing-relationships">14.2.5. Outgoing relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-directed-relationships-and-identifier">14.2.6. Directed relationships and identifier</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-by-relationship-type">14.2.7. Match by relationship type</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-by-multiple-relationship-types">14.2.8. Match by multiple relationship types</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-by-relationship-type-and-use-an-identifier">14.2.9. Match by relationship type and use an identifier</a></span></dt><dt><span class="section"><a href="query-match.html#match-match-with-labels">14.2.10. Match with labels</a></span></dt><dt><span class="section"><a href="query-match.html#match-relationship-types-with-uncommon-characters">14.2.11. Relationship types with uncommon characters</a></span></dt><dt><span class="section"><a href="query-match.html#match-multiple-relationships">14.2.12. Multiple relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-variable-length-relationships">14.2.13. Variable length relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-relationship-identifier-in-variable-length-relationships">14.2.14. Relationship identifier in variable length relationships</a></span></dt><dt><span class="section"><a href="query-match.html#match-zero-length-paths">14.2.15. Zero length paths</a></span></dt><dt><span class="section"><a href="query-match.html#match-optional-relationship">14.2.16. Optional relationship</a></span></dt><dt><span class="section"><a href="query-match.html#match-optional-typed-and-named-relationship">14.2.17. Optional typed and named relationship</a></span></dt><dt><span class="section"><a href="query-match.html#match-properties-on-optional-elements">14.2.18. Properties on optional elements</a></span></dt><dt><span class="section"><a href="query-match.html#match-shortest-path">14.2.19. Shortest path</a></span></dt><dt><span class="section"><a href="query-match.html#match-all-shortest-paths">14.2.20. All shortest paths</a></span></dt><dt><span class="section"><a href="query-match.html#match-named-path">14.2.21. Named path</a></span></dt><dt><span class="section"><a href="query-match.html#match-matching-on-a-bound-relationship">14.2.22. Matching on a bound relationship</a></span></dt></dl></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_introduction"></a>14.2.1. Introduction</h3></div></div></div><p>The <code class="literal">MATCH</code> clause allows you to specify the pattern Cypher will search for in the database.
Nodes and relationships that are already known at this stage are called <span class="emphasis"><em>bound pattern elements</em></span>.
Cypher will now try to find the unknown parts of the pattern.</p><p>If <code class="literal">MATCH</code> is the first clause in your query, nothing is bound at this stage.
Cypher needs start points to do it’s pattern matching.
If no bound nodes exist, Cypher can scan all nodes in the database, all nodes with a certain label, or it can use indexes to quickly find the relevant start points.
If you want to use index hints to force Cypher to use a specific index, read more here: <a class="xref" href="query-using.html" title="13.7. Using">Section 13.7, “Using”</a>.</p><p>After finding start points — either by using scans, indexes or already bound points, the execution engine will use pattern matching to find matching sub graphs.
Because Cypher is declarative, it can change order of these operations.
<code class="literal">WHERE</code> predicates can be evaluated before pattern matching, or during pattern matching, not only filtering after finding matches.</p><div class="tip" style="margin-left: 0; margin-right: 10%;"><table border="0" summary="Tip"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Tip]" src="images/icons/admon/tip.png" /></td><th align="left">Tip</th></tr><tr><td align="left" valign="top"><p>In the <code class="literal">MATCH</code> clause, patterns are used a lot.
Read <a class="xref" href="introduction-pattern.html" title="12.5. Patterns">Section 12.5, “Patterns”</a> for an introduction.</p></td></tr></table></div><p>The following graph is used for the examples below:</p><div class="figure"><a id="idp9168736"></a><p class="title"><strong>Figure 14.2. Graph</strong></p><div class="figure-contents"><a class="ulink" href="images/cypher-match-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-match-graph.svg" alt="cypher-match-graph.svg" /></span>
</a></div></div><br class="figure-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-get-all-nodes"></a>14.2.2. Get all nodes</h3></div></div></div><p>By just specifying a pattern with a single node and no labels, all nodes in the graph will be returned.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH n
RETURN n</pre><p>
</p><p>Returns all the nodes in the database.</p><div class="queryresult table"><a id="idp9176464"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">7 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Oliver Stone"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Charlie Sheen"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Martin Sheen"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"TheAmericanPresident",title:"The American President"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[6]{name:"Rob Reiner"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[7]{name:"Michael Douglas"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-get-all-nodes-with-a-label"></a>14.2.3. Get all nodes with a label</h3></div></div></div><p>Getting all nodes with a label on them is done with a single node pattern where the node has a label on it.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (movie:Movie)
RETURN movie</pre><p>
</p><p>Returns all the movies in the database.</p><div class="queryresult table"><a id="idp9199664"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">movie</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"TheAmericanPresident",title:"The American President"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-related-nodes"></a>14.2.4. Related nodes</h3></div></div></div><p>The symbol <code class="literal">--</code> means <span class="emphasis"><em>related to,</em></span> without regard to type or direction.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (director)--(movie)
WHERE director.name='Oliver Stone'
RETURN movie.title</pre><p>
</p><p>Returns all the movies directed by Oliver Stone.</p><div class="queryresult table"><a id="idp9216688"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">movie.title</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"Wall Street"</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-outgoing-relationships"></a>14.2.5. Outgoing relationships</h3></div></div></div><p>When the direction of a relationship is interesting, it is shown by using <code class="literal">--&gt;</code> or <code class="literal">&lt;--</code>, like this:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (martin)--&gt;(movie)
WHERE martin.name='Martin Sheen'
RETURN movie.title</pre><p>
</p><p>Returns nodes connected to Martin by outgoing relationships.</p><div class="queryresult table"><a id="idp9232592"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">movie.title</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"Wall Street"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"The American President"</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-directed-relationships-and-identifier"></a>14.2.6. Directed relationships and identifier</h3></div></div></div><p>If an identifier is needed, either for filtering on properties of the relationship, or to return the relationship, this is how you introduce the identifier.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (martin)-[r]-&gt;(movie)
WHERE martin.name='Martin Sheen'
RETURN r</pre><p>
</p><p>Returns all outgoing relationships from Martin.</p><div class="queryresult table"><a id="idp9248704"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:ACTED_IN[1]{}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">:ACTED_IN[3]{}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-by-relationship-type"></a>14.2.7. Match by relationship type</h3></div></div></div><p>When you know the relationship type you want to match on, you can specify it by using a colon together with the relationship type.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (wallstreet)&lt;-[:ACTED_IN]-(actor)
WHERE wallstreet.title='Wall Street'
RETURN actor</pre><p>
</p><p>Returns nodes that <code class="literal">ACTED_IN</code> Wall Street.</p><div class="queryresult table"><a id="idp9265456"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">actor</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Charlie Sheen"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Martin Sheen"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[7]{name:"Michael Douglas"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-by-multiple-relationship-types"></a>14.2.8. Match by multiple relationship types</h3></div></div></div><p>To match on one of multiple types, you can specify this by chaining them together with the pipe symbol <code class="literal">|</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (wallstreet)&lt;-[:ACTED_IN|:DIRECTED]-(person)
WHERE wallstreet.title='Wall Street'
RETURN person</pre><p>
</p><p>Returns nodes with a <code class="literal">ACTED_IN</code> or <code class="literal">DIRECTED</code> relationship to Wall Street.</p><div class="queryresult table"><a id="idp9285152"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">person</th></tr></thead><tfoot><tr><th align="left" valign="top">4 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Oliver Stone"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Charlie Sheen"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Martin Sheen"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[7]{name:"Michael Douglas"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-by-relationship-type-and-use-an-identifier"></a>14.2.9. Match by relationship type and use an identifier</h3></div></div></div><p>If you both want to introduce an identifier to hold the relationship, and specify the relationship type you want, just add them both, like this.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (wallstreet)&lt;-[r:ACTED_IN]-(actor)
WHERE wallstreet.title='Wall Street'
RETURN r</pre><p>
</p><p>Returns nodes that <code class="literal">ACTED_IN</code> Wall Street.</p><div class="queryresult table"><a id="idp9304880"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:ACTED_IN[0]{}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">:ACTED_IN[1]{}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">:ACTED_IN[2]{}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-match-with-labels"></a>14.2.10. Match with labels</h3></div></div></div><p>To constrain your pattern with labels on nodes, you add it to your pattern nodes, using the label syntax.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (charlie:Person)--&gt;(movie:Movie)
WHERE charlie.name='Charlie Sheen'
RETURN movie</pre><p>
</p><p>Return any nodes connected with Charlie that are labeled <code class="literal">Movie</code>.</p><div class="queryresult table"><a id="idp9323088"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">movie</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-relationship-types-with-uncommon-characters"></a>14.2.11. Relationship types with uncommon characters</h3></div></div></div><p>Sometime your database will have types with non-letter characters, or with spaces in them. Use <code class="literal">`</code> (backtick) to quote these.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)-[r:`TYPE THAT HAS SPACE IN IT`]-&gt;()
WHERE n.name='Rob Reiner'
RETURN r</pre><p>
</p><p>Returns a relationship of a type with spaces in it.</p><div class="queryresult table"><a id="idp9338448"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:TYPE THAT HAS SPACE IN IT[8]{}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-multiple-relationships"></a>14.2.12. Multiple relationships</h3></div></div></div><p>Relationships can be expressed by using multiple statements in the form of <code class="literal">()--()</code>, or they can be strung together, like this:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (charlie)-[:ACTED_IN]-&gt;(movie)&lt;-[:DIRECTED]-&gt;(director)
WHERE charlie.name='Charlie Sheen'
RETURN charlie,movie,director</pre><p>
</p><p>Returns the three nodes in the path.</p><div class="queryresult table"><a id="idp9353568"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /><col class="col3" /></colgroup><thead><tr><th align="left" valign="top">charlie</th><th align="left" valign="top">movie</th><th align="left" valign="top">director</th></tr></thead><tfoot><tr><th colspan="3" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Charlie Sheen"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[5]{name:"WallStreet",title:"Wall Street"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Oliver Stone"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-variable-length-relationships"></a>14.2.13. Variable length relationships</h3></div></div></div><p>Nodes that are a variable number of relationship→node hops away can be found using the following syntax: <code class="literal">-[:TYPE*minHops..maxHops]-&gt;</code>. minHops and maxHops are optional and default to 1 and infinity respectively. When no bounds are given the dots may be omitted.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (martin)-[:ACTED_IN*1..2]-(x)
WHERE martin.name='Martin Sheen'
RETURN x</pre><p>
</p><p>Returns nodes that are 1 or 2 relationships away from Martin.</p><div class="queryresult table"><a id="idp9374464"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">5 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Charlie Sheen"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[7]{name:"Michael Douglas"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"TheAmericanPresident",title:"The American President"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[7]{name:"Michael Douglas"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-relationship-identifier-in-variable-length-relationships"></a>14.2.14. Relationship identifier in variable length relationships</h3></div></div></div><p>When the connection between two nodes is of variable length, a relationship identifier becomes an collection of relationships.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (actor)-[r:ACTED_IN*2]-(co_actor)
WHERE actor.name='Charlie Sheen'
RETURN r</pre><p>
</p><p>The query returns a collection of relationships.</p><div class="queryresult table"><a id="idp9394944"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[:ACTED_IN[0]{},:ACTED_IN[1]{}]</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">[:ACTED_IN[0]{},:ACTED_IN[2]{}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-zero-length-paths"></a>14.2.15. Zero length paths</h3></div></div></div><p>Using variable length paths that have the lower bound zero means that two identifiers can point to the same node. If the distance between two nodes is zero, they are by definition the same node. Note that when matching zero length paths the result may contain a match even when matching on a relationship type not in use.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (wallstreet:Movie)-[*0..1]-(x)
WHERE wallstreet.title='Wall Street'
RETURN x</pre><p>
</p><p>Returns all nodes that are zero or one relationships away from Wall Street.</p><div class="queryresult table"><a id="idp9411088"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">5 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Charlie Sheen"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Martin Sheen"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[7]{name:"Michael Douglas"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Oliver Stone"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-optional-relationship"></a>14.2.16. Optional relationship</h3></div></div></div><p>If a relationship is optional, it can be marked with a question mark. This is similar to how a SQL outer join works. If the relationship is there, it is returned. If it’s not, <code class="literal">null</code> is returned in it’s place. Remember that anything hanging off an optional relationship, is in turn optional, unless it is connected with a bound node through some other path.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(5)
MATCH a-[?]-&gt;x
RETURN x</pre><p>
</p><p>Returns <code class="literal">null</code>, since the node has no outgoing relationships.</p><div class="queryresult table"><a id="idp9433408"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-optional-typed-and-named-relationship"></a>14.2.17. Optional typed and named relationship</h3></div></div></div><p>Just as with a normal relationship, you can decide which identifier it goes into, and what relationship type you need.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(5)
MATCH a-[r?:ACTS_IN]-&gt;()
RETURN r</pre><p>
</p><p>This returns a node, and <code class="literal">null</code>, since the node has no outgoing <code class="literal">ACTS_IN</code> relationships.</p><div class="queryresult table"><a id="idp9449216"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-properties-on-optional-elements"></a>14.2.18. Properties on optional elements</h3></div></div></div><p>Returning a property from an optional element that is <code class="literal">null</code> will also return <code class="literal">null</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START a=node(5)
MATCH a-[?]-&gt;x
RETURN x, x.name</pre><p>
</p><p>Returns the element x (<code class="literal">null</code> in this query), and <code class="literal">null</code> as its name.</p><div class="queryresult table"><a id="idp9466288"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">x</th><th align="left" valign="top">x.name</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-shortest-path"></a>14.2.19. Shortest path</h3></div></div></div><p>Finding a single shortest path between two nodes is as easy as using the <code class="literal">shortestPath</code> function. It’s done like this:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH p = shortestPath((martin:Person)-[*..15]-(oliver:Person))
WHERE martin.name = 'Martin Sheen' AND oliver.name = 'Oliver Stone'
RETURN p</pre><p>
</p><p>This means: find a single shortest path between two nodes, as long as the path is max 15 relationships long. Inside of the parenthesis
 you define a single link of a path — the starting node, the connecting relationship and the end node. Characteristics describing the relationship
 like relationship type, max hops and direction are all used when finding the shortest path. You can also mark the path as optional.</p><div class="queryresult table"><a id="idp9484928"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[Node[3]{name:"Martin Sheen"},:ACTED_IN[1]{},Node[5]{name:"WallStreet",title:"Wall Street"},:DIRECTED[5]{},Node[1]{name:"Oliver Stone"}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-all-shortest-paths"></a>14.2.20. All shortest paths</h3></div></div></div><p>Finds all the shortest paths between two nodes.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">START martin=node(3), michael=node(7)
MATCH p = allShortestPaths(martin-[*]-michael)
RETURN p</pre><p>
</p><p>Finds the two shortest paths between Martin and Michael.</p><div class="queryresult table"><a id="idp9499664"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[Node[3]{name:"Martin Sheen"},:ACTED_IN[3]{},Node[4]{name:"TheAmericanPresident",title:"The American President"},:ACTED_IN[4]{},Node[7]{name:"Michael Douglas"}]</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">[Node[3]{name:"Martin Sheen"},:ACTED_IN[1]{},Node[5]{name:"WallStreet",title:"Wall Street"},:ACTED_IN[2]{},Node[7]{name:"Michael Douglas"}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-named-path"></a>14.2.21. Named path</h3></div></div></div><p>If you want to return or filter on a path in your pattern graph, you can a introduce a named path.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH p =(michael)--&gt;()
WHERE michael.name='Michael Douglas'
RETURN p</pre><p>
</p><p>Returns the two paths starting from Michael.</p><div class="queryresult table"><a id="idp9515776"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[Node[7]{name:"Michael Douglas"},:ACTED_IN[2]{},Node[5]{name:"WallStreet",title:"Wall Street"}]</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">[Node[7]{name:"Michael Douglas"},:ACTED_IN[4]{},Node[4]{name:"TheAmericanPresident",title:"The American President"}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="match-matching-on-a-bound-relationship"></a>14.2.22. Matching on a bound relationship</h3></div></div></div><p>When your pattern contains a bound relationship, and that relationship pattern doesn’t specify direction,
Cypher will try to match the relationship where the connected nodes switch sides.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH a-[r]-b
WHERE id(r)= 0
RETURN a,b</pre><p>
</p><p>This returns the two connected nodes, once as the start node, and once as the end node.</p><div class="queryresult table"><a id="idp9532176"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">a</th><th align="left" valign="top">b</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Charlie Sheen"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[5]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"WallStreet",title:"Wall Street"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Charlie Sheen"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp1064128.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-start.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="query-read.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-where.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
